In [2]:
import pandas as pd

In [5]:
sr1=pd.Series([1,3,2,5,9,6])
sr1

0    1
1    3
2    2
3    5
4    9
5    6
dtype: int64

In [7]:
type(sr1)

pandas.core.series.Series

#### syam

# syam

## syam

### syam

In [22]:
df1=pd.DataFrame({'id':[1,2,3,4],'start_marks':[98,81,90,88]})
df2=pd.DataFrame({'id':[3,4,5,6],'ml_marks':[99,88,66,55]})
df2

   id  ml_marks
0   3        99
1   4        88
2   5        66
3   6        55

In [25]:
df1.merge(df2,on='id',how='right')

   id  start_marks  ml_marks
0   3         90.0        99
1   4         88.0        88
2   5          NaN        66
3   6          NaN        55

In [17]:
df1.merge(df2,on='id') #how= inner,outer,right,left

   id  start_marks  ml_marks
0   3           90        99
1   4           88        88

In [26]:
df3=pd.concat([df1,df2]) #is means union

In [20]:
df1.join(df2)

   id  start_marks  sno  ml_marks
0   1           98    3        99
1   2           81    4        88
2   3           90    5        66
3   4           88    6        55

In [29]:
df3.reset_index()

   index  id  start_marks  ml_marks
0      0   1         98.0       NaN
1      1   2         81.0       NaN
2      2   3         90.0       NaN
3      3   4         88.0       NaN
4      0   3          NaN      99.0
5      1   4          NaN      88.0
6      2   5          NaN      66.0
7      3   6          NaN      55.0

In [30]:
df3.reset_index()

   index  id  start_marks  ml_marks
0      0   1         98.0       NaN
1      1   2         81.0       NaN
2      2   3         90.0       NaN
3      3   4         88.0       NaN
4      0   3          NaN      99.0
5      1   4          NaN      88.0
6      2   5          NaN      66.0
7      3   6          NaN      55.0

In [33]:
df3.reset_index(drop=True)

   id  start_marks  ml_marks
0   1         98.0       NaN
1   2         81.0       NaN
2   3         90.0       NaN
3   4         88.0       NaN
4   3          NaN      99.0
5   4          NaN      88.0
6   5          NaN      66.0
7   6          NaN      55.0

In [37]:
df3.reset_index(drop=True,inplace=True)

In [38]:
df3

   id  start_marks  ml_marks
0   1         98.0       NaN
1   2         81.0       NaN
2   3         90.0       NaN
3   4         88.0       NaN
4   3          NaN      99.0
5   4          NaN      88.0
6   5          NaN      66.0
7   6          NaN      55.0

In [3]:
re=pd.read_csv('Auto.csv')
re.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino